Repository: 84000/data-translation-memory
Catalog: toh195_84000-the-avalokini-sutra.tmx
Source language: bo
Languages: en

source: །རྒྱལ་བའི་མཆོད་རྟེན་ལ་ནི་འབུམ་ཕུལ་ནས།
en: Then, by making hundreds of thousands of offerings to the victors’ stūpas,

source: །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་སྟོབས་ལྡན་གྱུར།
en: “I became a powerful king, a universal monarch

source: །སྟོང་ཕྲག་བཅུ་ལ་དབང་བར་ང་གྱུར་ཏེ། །ནོར་ཆེན་རབ་ཏུ་མཛོད་མང་ཚོང་དཔོན་གྱུར།
en: Ruling over ten thousand worlds. I became a wealthy merchant possessing a great fortune,

source: །ཁྱིམ་བདག་བློ་ལྡན་བསོད་ནམས་ལྡན་པར་གྱུར།
en: And an intelligent and meritorious householder.

source: །བདེ་གཤེགས་མི་མཆོག་བྱེ་བ་ཉི་ཤུ་དག །ངས་ནི་མཉེས་བྱས་གཟིམས་ཆ་ན་བཟའ་ཡིས།
en: “I pleased two hundred million well-gone ones, supreme among humans.

source: །མི་མཆོག་དག་ལ་བླ་མར་བསྟི་སྟང་བྱས།
en: I honored these supreme human beings By offering them bedding and garments,

source: །དེ་དག་གཙུག་ལག་ཁང་ལ་སྤོས་ཀྱིས་བསྐུས།
en: And anointing them with perfumes in their monasteries.

source: །ང་ཡི་ཁ་དོག་ངན་པ་ཀུན་མེད་འགྱུར།
en: “Thus, my complexion will never become ugly,

source: །ངས་ནི་ཚ་དང་གྲང་དང་ངལ་བ་སྤོང་།
en: And I will dispel heat, cold, and hardship.

source: །སངས་རྒྱས་སྤྱན་སྔར་དམན་མེད་སེམས་གྱུར་ཅིང་།
en: In the presence of the buddhas, I always adopted a superior attitude,

source: །དེ་དག་མཆོད་པ་དམ་པ་མཆོག་གིས་མཆོད།
en: And worshiped them with supreme and sacred offerings.

source: །རྒྱན་གྱིས་བརྒྱན་པའི་གདུགས་མཛེས་བལྟ་སྡུག་པ།
en: “Whoever offers beautiful and elegant parasols decorated with ornaments

source: །སུ་ཞིག་བཅོམ་ལྡན་མཆོད་རྟེན་འབུལ་བྱེད་པ།
en: To the stūpa of a blessed one

source: །དེ་འདིར་ལུས་ནི་མཚུངས་པ་མེད་འགྱུར་ཏེ།
en: Will be endowed with an unequalled body,

source: །གང་གིས་རྒྱལ་བའི་སྐུ་ནི་རབ་འབར་ཞིང་།
en: “That person will attain the radiant body of the victors,

source: །ཁྱད་པར་འཕགས་པའི་གཟུགས་དང་སེམས་འདྲ་དང་། །འཛམ་ཀླུང་གསེར་ལྟར་རབ་མཛེས་བལྟ་ན་སྡུག །མཚན་གྱི་མེ་ཏོག་རྒྱས་པས་མངོན་དུ་གང་།
en: And have a preeminent appearance and mind. Beautiful and lovely to behold, like the gold of the Jambū river, He will be replete with the blooming flowers of the thirty-two marks.

source: །མངོན་པར་ཤེས་པ་འཐོབ་ཅིང་དབང་ཆེར་གྲགས།
en: “He will possess the superknowledges, be renowned for his power,

source: །བྱང་ཆུབ་སྤྱོད་མཆོག་དམ་པ་ཞི་བ་སྤྱོད།
en: And practice supreme awakened conduct—sublime and peaceful.

source: །དེ་ནི་ནམས་ཀྱང་ལོངས་སྤྱོད་འགྲིབ་མི་འགྱུར།
en: His possessions will never decrease,

source: །ལྷས་ཀྱང་བསྟི་སྟང་བྱ་ཞིང་མཆོད་པར་འོང་།
en: And he will be honored and worshiped by the gods.

source: །བརྟན་པ་འདོད་པའི་ལོངས་སྤྱོད་གཞར་མི་དཀའ།
en: “This steadfast one will have no trouble abandoning desired possessions.

source: །ཚུལ་ཁྲིམས་རྣམ་དག་རབ་མཁས་ཚངས་པར་སྤྱོད།
en: Pure in discipline, he will be highly learned and practice pure conduct.

source: །ཡི་དམ་བཅས་ནས་ནགས་དང་ནགས་འདབ་སོང་།
en: With a strong commitment, he will wander in forests and jungles,

source: །མངོན་ཤེས་འཐོབ་ཅིང་ཁྱད་པར་འཐོབ་པར་འགྱུར།
en: And develop the superknowledges and other extraordinary qualities.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་གདུགས་འབུལ་བ།
en: “Whoever offers parasols to the stūpas of the blessed ones

source: །ཇི་ལྟ་བུ་ཡང་བྱང་ཆུབ་སེམས་མི་འདོར།
en: Will never give up the mind set on awakening.

source: །བྱམས་ལ་གནས་ཤིང་མི་དམན་སེམས་སུ་འགྱུར།
en: He will be loving and free from inferior attitudes,

source: །དེ་ཡི་ཤེས་པ་ནམས་ཀྱང་ཉམས་པ་མེད།
en: And his insight will never decline.

source: །རོལ་མོའི་སྒྲ་ཡིས་མི་མཆོག་མཆོད་བྱས་ན།
en: “Whoever worships the supreme among humans with music

source: །མྱ་ངན་མེད་ཅིང་དབང་ལྡན་རྒྱལ་པོར་འོང་།
en: Will be free from misery and will become a powerful king.

source: །མི་ཡི་འཇིག་རྟེན་ཡིད་འོང་སྒྲ་ལྡན་འགྱུར།
en: In the human world, his voice will be charming,

source: །དེ་སྒྲ་ཡན་ལག་ཚང་ཞིང་དག་པར་འོང་།
en: And the sound of it will be full and clear in all aspects.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རོལ་མོའི་སྒྲ་བྱས་ན།
en: “Whoever offers music to the stūpa of a blessed one

source: །ཤེས་བཞིན་ལྡན་ཞིང་མིག་ནི་རྣམ་དག་འགྱུར།
en: Will be alert and endowed with flawless eyes and ears.

source: །རྣ་བ་རྣམ་པར་དག་ཅིང་སེམས་ཀྱང་དགའ།
en: He will be joyful,

source: །སྣ་ཡི་དབང་པོ་མཆོག་དང་ལྡན་པར་འགྱུར།
en: And his faculty of smell will be supreme.

source: །དེ་ཡི་ལྕེ་ནི་རབ་མཛེས་བལྟ་ན་སྡུག །ཐོག་མར་རབ་མཉེན་མཛེས་ཤིང་སྒྲ་ཡིད་འོང་།
en: “His tongue will be beautiful and pleasing to behold. Foremost, it will be supple, pretty, and melodious.

source: །དཔེར་ན་ལྷ་ཡི་རིན་ཆེན་བྱེ་རུ་འདྲ།
en: Like the precious coral of the gods,

source: །སྒྲ་སྐད་ཡན་ལག་བྱེ་བ་དཔག་མེད་འབྱིན།
en: It will call out in countless millions of sounds.

source: །ནམས་ཀྱང་སྦྲུལ་དུ་མི་འགྱུར་ལྕེ་མེད་མིན།
en: Will never be born as a snake, without a tongue,

source: །ཞར་བ་སྒུར་པོ་ཡ་ཡོ་ཅན་མི་འགྱུར།
en: Blind, crippled, or crooked.

source: །ལུས་ནི་ཁྱད་པར་འཕགས་ཤིང་ཤིན་ཏུ་མཛེས།
en: Instead, he will be preeminent in body and extremely handsome.

source: །ལྷ་འམ་ཀླུ་འམ་མི་འམ་ལྟོ་འཕྱེ་ཆེ། །སུ་ཡང་དེ་ལ་མ་དད་སྐྱེད་མི་འགྱུར།
en: By any gods, nāgas, humans or mahoragas.

source: །དབུགས་ཕྱིན་ཐོབ་ནས་འཇིག་རྟེན་ཀུན་ཏུ་རྒྱུ།
en: Having found relief, he will move about in the worlds.

source: །དེ་ནི་མ་ནིང་ཟ་མར་གཞར་མི་འགྱུར།
en: Will never become a person labeled a paṇḍaka,

source: །ནམས་ཀྱང་མཛེ་དང་ཤ་བཀྲ་མི་འབྱུང་ཞིང་།
en: Or be struck with leprosy or any other skin disease.

source: །བསྔགས་པར་འོས་པའི་ལུས་ནི་ཐོབ་པར་འགྱུར།
en: Instead, he will obtain a body worthy of praise.

source: །ལྕེ་རིང་འགྱུར་ཞིང་ལུས་ཀྱང་ཆེ་བར་འགྱུར།
en: Will obtain a long tongue and a large body.

source: །གསེར་གྱི་གཟུགས་ལྟར་ཁ་དོག་འབར་བར་འོང་།
en: He will be endowed with a radiant complexion, like a golden statue.

source: །ཏིང་འཛིན་བརྟན་ཞིང་ཤིན་ཏུ་རྟོགས་པར་འགྱུར།
en: His absorption will be stable, and he will become highly realized.

source: །ལྷ་ནང་བདག་པོར་འགྱུར་ཞིང་དབང་ཕྱུག་འགྱུར།
en: Will become the leader of the gods, and Īśvara.

source: །མི་ཡི་འཇིག་རྟེན་སྐྱེས་ན་དགའ་བར་འོང་།
en: If he is born into the human world, he will be joyful,

source: །བརྩོན་འགྲུས་ལྡན་ཞིང་བག་ཡོད་འབར་བར་འགྱུར།
en: Diligent, and brilliantly conscientious.

source: །དེ་ལ་སུ་ཡང་ཡིད་མི་བདེ་མི་སྐྱེད།
en: Will not be distressed by anyone

source: །དེ་ལ་སུ་ཡང་ཚིག་རྩུབ་སྨྲ་བ་མེད།
en: Or spoken to harshly by anyone.

source: །ཕྲ་མ་ཐམས་ཅད་སྤངས་ཤིང་ཡང་དག་སྨྲ།
en: He will abandon all divisive speech and speak honestly.

source: །བསོད་ནམས་འདོད་པ་སུ་ཞིག་ཕྱགས་ཐོགས་ཏེ།
en: “Whoever, desiring merit, picks up a broom

source: །བཅོམ་ལྡན་མཆོད་རྟེན་གུས་པར་འཕྱག་བྱེད་པ།
en: And respectfully sweeps the stūpa of a blessed one

source: །དེ་ནི་སྨད་ཅིང་མི་གཙང་ལུས་མི་འགྱུར།
en: Will not be born with an inferior or filthy body.

source: །བ་སྤུ་ཁུང་ནས་ཙན་དན་དྲི་ངད་འབྱུང་།
en: Instead, the fragrant scent of sandalwood will waft from his pores.

source: །བཅོམ་ལྡན་མྱ་ངན་འདས་པའི་མཆོད་རྟེན་ཕྱགས།
en: “Whoever sweeps the stūpa of a blessed one who has passed into nirvāṇa

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ།
en: Will, for billions and trillions of eons,

source: །ཡན་ལག་མ་སྨད་ཁྱད་འཕགས་ལུས་འཐོབ་ཅིང་།
en: Obtain preeminent bodies with perfect limbs.

source: །མཛེས་ལ་མཚན་གྱིས་གོ་ཆར་བྱས་པར་འགྱུར།
en: He will be handsome and wear the armor of the marks.

source: །བཅོམ་ལྡན་མྱ་ངན་འདས་པའི་མཆོད་རྟེན་ཕྱགས། །ལྷ་ཡི་ཙན་དན་ཁྱད་འཕགས་རབ་མཛེས་པའི།
en: “Whoever sweeps the stūpa of a blessed one who has passed into nirvāṇa

source: །གཞལ་མེད་ཁང་མཆོག་ཡིད་འོང་དྲི་ལྡན་འཐོབ།
en: Will obtain supreme, delightful, and fragrant palaces Made of the most exquisite and extraordinary divine sandalwood,

source: །དེ་ནི་དེ་ལ་གཞར་ཡང་སྲེད་མི་སྐྱེད།
en: Without ever feeling desire for them. “Whoever sweeps the stūpa of a blessed one who has passed into nirvāṇa

source: །ཡིད་འོང་དྲི་ལྡན་མཆོག་ཏུ་བལྟ་སྡུག་པའི། །ལྷ་ཡི་བུ་མོ་བྱེ་བ་སྟོང་འཐོབ་ཅིང་།
en: Sweet-scented and supremely attractive,

source: །དེ་ནི་དེ་ལ་ནམས་ཀྱང་ཆགས་མི་སྐྱེད།
en: Without ever becoming attached to them.

source: །སྐྱེད་མོས་ཚལ་མཆོག་ཡོད་པའི་རྫིང་བུ་ནི།
en: Will obtain the finest gardens full of ponds,

source: །ཡན་ལག་བརྒྱན་ལྡན་ཆུ་གཙང་མཛེས་གྱུར་པ།
en: Filled with pristinely pure water of the eight qualities

source: །མེ་ཏོག་ཨུད་པལ་ལས་ནི་རྒྱས་པ་འཐོབ།
en: And blue lotus flowers in full bloom.

source: །དེ་ཡི་གཡོག་འཁོར་རྟག་ཏུ་འཐུན་འགྱུར་ཞིང་།
en: Will always be in harmony with his servants and attendants.

source: །མི་དམན་སེམས་ཅན་ལྷ་ཡི་སྒྲ་ཡང་ཐོས།
en: With a superior attitude, he will hear the voices of the gods

source: །ལྷ་མོ་རྣམས་ཀྱི་གླུ་དབྱངས་སྙན་སྒྲ་ཐོས།
en: And the sweet melodies of the goddesses’ songs.

source: །འཇིག་རྟེན་ཀུན་ཏུ་སྐྱེས་ཚེ་བདག་ཉིད་ཀྱིས།
en: Will, upon taking birth in all his existences,

source: །འདི་ནས་ཤི་འཕོས་ངན་འགྲོར་མི་འགྲོ་ཞིང་།
en: Know that after he dies, he will not be reborn into the lower realms,

source: །མི་ཡི་འཇིག་རྟེན་སངས་རྒྱས་མཐོང་བར་ཤེས།
en: But will instead meet a buddha in the human world.

source: །དེ་ནི་ལྷ་ལ་སྙན་པའི་གཏམ་བྱས་ཏེ།
en: Will deliver pleasant discourses to the gods,

source: །སངས་རྒྱས་ཡེ་ཤེས་རྫོགས་ལ་ལྷ་བཀོད་ནས།
en: To establish them in perfect awakened wisdom,

source: །ཤི་བའི་དུས་བྱས་འཛམ་བུའི་གླིང་དུ་སྐྱེ།
en: And then pass away to be reborn in Jambudvīpa.

source: །བཙས་མ་ཐག་ཏུ་བསྐལ་པ་མཐའ་ཡས་དྲན།
en: Will, as soon as he is born, recall countless past eons.

source: །སྔོན་གྱི་སངས་རྒྱས་གཙོ་རྣམས་བཀུར་བ་དང་། །དེ་དག་མཚན་དང་ཡོན་ཏན་ཆོས་ཀྱང་དྲན།
en: He will honor the buddhas of the past—the leaders— And recall their marks, qualities, and teachings.

source: །འཇིག་རྟེན་སངས་རྒྱས་ཇི་ལྟར་འགྱུར་ཞེས་ཏེ།
en: “I shall now explain the benefits

source: །མོས་པ་བསྐྱེད་ནས་མཆོད་རྟེན་རྩྭ་སྐྱེས་སེལ། །དེ་ཡི་ཕན་ཡོན་དེ་དག་ངས་བཤད་ཀྱིས།
en: Of removing weeds from a stūpa, With a wish to be like the buddhas in the world;

source: །ཐ་བ་དྲི་སོལ་དང་བའི་སེམས་ཀྱིས་ཉོན།
en: So listen sincerely, with a mind free from the stains of afflictions! “Such a person will, in the future, meet

source: །མཐུ་ཆེན་སྐྱེས་བུ་དམ་པ་ཁྱད་འཕགས་པ། །རྒྱལ་བ་དམ་པ་མ་འོངས་དུས་ན་མཐོང་།
en: The sublime victors—those powerful, sublime, and preeminent beings.

source: །དེ་ནི་གཞར་ཡང་དད་པ་དམ་པ་འཐོབ།
en: And will always develop sublime faith.

source: །སངས་རྒྱས་སྟོབས་བཅུ་དེད་དཔོན་དེས་མཐོང་ནས།
en: “Upon meeting the captains, the buddhas with the ten powers,

source: །འདྲེན་པ་མཚུངས་པ་མེད་ལ་མཆོད་པ་བྱས། །མཚན་གྱིས་གོ་ཆར་བྱས་པའི་སངས་རྒྱས་སུ།
en: He will worship those peerless leaders.

source: །འགྱུར་ཞེས་ཐུགས་དགྱེས་དེ་དག་ལུང་ཡང་སྟོན། །གྲོང་ཁྱེར་ཡངས་པ་ཉམས་དགའ་མཆོག་གནས་ཤིང་།
en: With joy in their hearts, they will prophesy, ‘You will become a buddha who puts on the armor of the marks!’

source: །ང་ནི་ཆོས་སྟོན་གང་གིས་མཐོང་གྱུར་པ།
en: “Whoever has seen me teaching the Dharma In the delightful city of Vaiśālī, the supreme abode,

source: །དེ་དག་ཕྱི་དུས་རབ་ཏུ་འཇིག་པའི་ཚེ།
en: Will, in the future, during the time of decline,

source: །རྒྱལ་མཆོག་མྱ་ངན་འདས་པའི་ཆོས་འཛིན་འགྱུར།
en: Uphold the Dharma of the supreme victors who have passed into nirvāṇa.

source: །མཆོད་རྟེན་རྩྭ་སྐྱེས་སེལ་བར་བྱེད་པ་ནི། །རྒྱལ་བ་དམ་པ་མི་ཐུལ་མཐོང་འདོད་པའི།
en: “Removing weeds from a stūpa

source: །རྒྱུ་དང་ས་བོན་འགྱུར་བ་འདི་ཡིན་ནོ།
en: Is both the cause and the seed Of wishing to meet the unassailable sublime victors.

source: །འདོད་དང་དམྱལ་དང་དུད་འགྲོའི་སྐྱེ་གནས་སྤོང་།
en: One will abandon desire, the hells, and the animal realms.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་མདོ་མཆོག་འདི།
en: “When a bodhisattva upholds this supreme sūtra

source: །ཕྱི་མ་རབ་འཇིག་དུས་ན་འཛིན་བྱེད་པ།
en: In the future, during the time of decline, He will become a preeminent and matchless field of merit,

source: །དེ་ནི་འཇིག་རྟེན་སངས་རྒྱས་ལྷ་ཡི་ལྷ། །བསོད་ནམས་ཁྱད་འཕགས་མཚུངས་མེད་ཞིང་དུ་འགྱུར།
en: A buddha in the world, a god of gods.

source: །འདི་བཤད་ཚེ་ན་གང་དག་འདིར་མཆོད་དང་། །ཚུལ་འདི་བཤད་པ་གང་དག་ཐོས་པ་དང་། །གང་དག་མདོ་མཆོག་འདི་ནི་འདིར་བཟུང་བ།
en: “Those who worship this teaching when I have taught it, Those who hear this precept that I have taught, Those who memorize this supreme sūtra,

source: །དེ་དག་ཕྱི་མའི་དུས་ན་འདིར་འདི་འཛིན།
en: They will uphold it in the future.

source: །གང་དག་ཕྱིན་ཆད་མདོ་མཆོག་འདི་འཛིན་པ།
en: “Those who henceforth uphold this supreme sūtra

source: །དེ་དག་རྟག་ཏུ་ང་དང་འཐུན་པའི་སྲས།
en: Will always be my harmonious children.

source: །སངས་རྒྱས་བྱེ་བས་དེ་དག་བསྔགས་བརྗོད་ཀྱང་།
en: Even if they were praised by ten million buddhas,

source: །དེ་དག་བསྔགས་པ་མཐར་ནི་ཕྱིན་མི་འགྱུར། །གང་དག་ཕྱི་དུས་རྒྱལ་བའི་ཆོས་འཛིན་པ།
en: Their praises would never come to an end.

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་མཐའ་ཡས།
en: “Even if for ten million eons,

source: །བསྐལ་པ་བྱེ་བར་བཞུགས་ཏེ་དེ་དག་གི།
en: Countless billions and trillions of buddhas were to praise Those who in the future will uphold the victors’ Dharma,

source: །བསྔགས་པ་བརྗོད་ཀྱང་མཐའ་མར་ཕྱིན་མི་ནུས།
en: Their praises could never come to an end. “Whoever anoints the stūpa of a buddha in the prescribed way,

source: །དྲི་ཞིམ་ཡིད་འོང་སྤོས་ཀྱི་ཆོ་ག་བཞིན། །སངས་རྒྱས་མཆོད་རྟེན་ལ་ནི་སུ་སྐུད་པ།
en: With sweet and pleasant perfumes

source: །དེ་ནི་ཐོབ་རྙེད་འཇིག་རྟེན་ཀུན་ཏུ་རྒྱུ།
en: Will reach the attainments and move about in all the worlds.

source: །དེ་ནི་ས་འདིར་སྙིང་པོ་བླངས་པར་འགྱུར།
en: He will extract what is essential on this earth.

source: །རྒྱལ་བའི་མཆོད་རྟེན་སྤོས་བྱུག་ཕུལ་བྱས་ན། །བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་འཇིག་འགྱུར་ཚེ།
en: “Whoever offers scented ointments to the stūpa of a victorious one

source: །འཛམ་བུའི་གླིང་དུ་སྐྱེ་བར་མི་འགྱུར་ཞིང་།
en: Will not be reborn in Jambudvīpa At a time when the blessed ones’ teachings are in decline,

source: །དེ་ནི་དེ་ཚེ་མཐོ་རིས་བདག་པོར་འགྱུར།
en: But instead will become a ruler in the higher realms.

source: །རྒྱལ་བའི་མཆོད་རྟེན་སྤོས་བྱུག་ཕུལ་བྱས་ན།
en: “Whoever offers scented ointments to the stūpa of a victorious one

source: །དྲི་མི་ཞིམ་དང་མི་གཙང་སྨད་པ་རྣམས། །རྟག་ཏུ་སྤོང་ཞིང་ཚུལ་ཁྲིམས་ཕུང་པོར་གནས།
en: Will forever abandon the smelly, the unclean, and the inferior. Instead, he will observe discipline,

source: །དེ་ནི་རྟག་ཏུ་ཚངས་སྤྱོད་མཆོག་འདིར་སྤྱོད།
en: And always engage in the supreme pure conduct.

source: །འདི་ནས་ཤི་འཕོས་མཐོ་རིས་ལྷ་དབང་འགྱུར།
en: Will, after he dies, become the lord of gods in the higher realms.

source: །རིང་པོར་མི་ཐོགས་དོན་སྟོང་རྣམས་ལ་རྟོག །ལྷ་རྣམས་ལ་ནི་རྒྱ་ཆེན་དོན་ཀྱང་བྱེད།
en: Before long, he will conceive myriad aims, And he will accomplish the benefit of the gods on a vast scale.

source: །གང་གི་ཚེ་ན་མི་ཡི་འཇིག་རྟེན་ན།
en: At times when beings in the human world

source: །ཞེ་སྡང་མེད་སེམས་འཇམ་ཞིང་མཉེན་གྱུར་པ། །དེ་ཚེ་དེ་ན་འཛམ་བུའི་གླིང་དུ་གནས།
en: Are free from anger and their minds are gentle and pliable.

source: །ཁྱད་འཕགས་ཚིག་ལྡན་སྒྲ་དབྱངས་ཡིད་འོང་འགྱུར།
en: Will be preeminently eloquent and have a delightful voice.

source: །སྐྱེ་བོ་མང་པོ་ཡིད་འོང་དགའ་ཞིང་བཀུར།
en: He will be pleased and honored by many beings,

source: །དེ་ཡི་ཁ་བཞིན་རྟག་ཏུ་གསལ་བར་འགྱུར།
en: And his face will always be luminous.

source: །དེ་ནི་ངན་སོང་ས་རྣམས་མ་ལུས་སྤོང་།
en: Will leave all the lower realms behind,

source: །དེ་བཞིན་གཤེགས་དང་ཉེ་བ་ཐོབ་པར་འགྱུར།
en: And will be born close to the thus-gone ones.

source: །དད་པ་ཐོབ་ཅིང་རྟག་ཏུ་བདེ་ལ་དགའ།
en: He will develop faith and will always be happy and joyful.

source: །རྒྱལ་པོ་སྟོབས་ལྡན་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: Will become a powerful king, a universal monarch, and

source: །བློན་པོ་ཚོང་དཔོན་ཁྱིམ་བདག་བསོད་ནམས་ལྡན།
en: A meritorious minister, merchant, or householder,

source: །ཆོས་རྗེ་འོད་མཛད་སངས་རྒྱས་སུ་ཡང་འགྱུར།
en: As well as a radiant Dharma lord—a buddha.

source: །དགའ་བའི་སེམས་ཀྱིས་མགུ་བའི་ཤུགས་སྐྱེད་དེ།
en: “Whoever joyfully and enthusiastically

source: །བཅོམ་ལྡན་མཆོད་རྟེན་ནོར་བུའི་དྲ་བ་འབུལ།
en: Offers a jeweled lattice to the stūpa of a blessed one

source: །དེ་ནི་རྒྱལ་པོ་མཚན་གྱི་གོ་ཆ་ཅན།
en: Will become a king adorned with the armor of the marks,

source: །མཐུ་ཆེན་བླ་མ་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: A powerful, exalted universal monarch.

source: །བལྟ་འོས་མཚན་གྱི་གོ་ཆ་ལྡན་གྱུར་ནས།
en: “Highly regarded and adorned with the armor of the marks,

source: །གཞལ་མེད་ཁང་ཆེན་རབ་མཛེས་བལྟ་སྡུག་པ།
en: He will enjoy vast, exquisite, and delightful palaces

source: །ཁ་དོག་སྣ་ཚོགས་དཔག་མེད་ལྡན་པ་དང་། །རིན་ཆེན་ཁང་བཟངས་ཆེ་འོས་དག་པ་འཐོབ།
en: In an endless variety of colors, And impressive mansions made of precious gems.

source: །རྒྱལ་པོའི་ཕོ་བྲང་ཁྱད་པར་འཕགས་གྱུར་པ།
en: “He will obtain preeminent royal palaces

source: །སྐྱེས་པ་བུད་མེད་དག་གིས་གང་བ་དང་། །མཉམ་ཞིང་ལེགས་བྱས་རབ་མཛེས་བལྟ་སྡུག་པ།
en: Filled with men and women, Proportionate, elegant, exquisite, delightful,

source: །དྲ་བ་སྣ་ཚོགས་བདེ་བྱེད་བདེ་འཇུག་འཐོབ།
en: And ornamented with variegated lattices, pleasant, and comfortable. “He will also obtain preeminent royal attributes,

source: །རྒྱལ་མཚན་བ་དན་གསལ་བར་མཛེས་བྱས་ཤིང་།
en: Such as brilliantly majestic victory banners and flags,

source: །གདུགས་བྲེས་ཤིན་ཏུ་མཛེས་ལ་བལྟ་སྡུག་དང་། །མུ་ཏིག་དྲ་བ་ཕྲེང་བ་དེ་འདྲ་བའི།
en: Splendid and delightful canopies, As well as necklaces of pearl.

source: །རྒྱལ་སྲིད་ཡོན་ཏན་ཁྱད་འཕགས་གཞན་ཡང་འཐོབ།
en: “No robbers, thieves, deceivers, or wicked people

source: །དེ་ཡི་ཡུལ་ན་གཞན་ནོར་འཇིག་བྱེད་པ།
en: Will live in his lands.

source: །ཆོམ་རྐུན་གཡོ་ལྡན་གཡོན་ཅན་གནས་མི་འགྱུར།
en: The people residing in his lands will be open minded,

source: །སེམས་ཅན་རྒྱ་ཆེན་བློ་མཆོག་ལྡན་པ་དང་། །ཕན་བྱེད་བྱམས་སེམས་ལྡན་པ་དེ་ན་གནས།
en: Intelligent, altruistic, and affectionate.

source: །ཤི་འཕོས་བག་ཡོད་དེ་ནི་ལྷར་འགྲོ་སྟེ།
en: “After he dies and transfers, this conscientious one will go to the gods. While residing in the higher realms, this intelligent person will ponder,

source: །དཀར་གནག་གང་ཡིན་བདག་ཅག་ཇི་ལྟར་གནས།
en: ‘What conduct should I observe, in terms of good and bad actions,

source: །འདི་ནས་ཤི་འཕོས་ཇི་ལྟར་མིར་སྐྱེ་ཞེས། །བློ་ལྡན་དེ་ནི་མཐོ་རིས་འདི་གནས་འགྱུར།
en: To be reborn as a human after I die and transfer?’

source: །སངས་རྒྱས་སྦྱིན་གནས་མྱུར་དུ་མཐོང་འགྱུར་ཏེ།
en: “He will swiftly meet the buddhas, who are worthy of offerings,

source: །མཐོང་ནས་མཆོད་ཅིང་མཚུངས་མེད་བསྟི་སྟང་བྱེད།
en: And will worship and honor them in ways that cannot be matched.

source: །སངས་རྒྱས་མཐོང་ནས་བྱང་ཆུབ་མོས་སྐྱེད་ཅིང་།
en: Upon meeting the buddhas, he will give rise to the aspiration for awakening,

source: །རྡུལ་བྲལ་རྣམས་ལ་ཕྱིར་ཞིང་བསྟི་སྟང་བྱེད།
en: And honor those stainless beings again and again.

source: །ཡེ་ཤེས་མཐའ་ཡས་ལྡན་དང་མཐུ་ཆེན་འགྱུར།
en: “He will be endowed with infinite wisdom and great power,

source: །ཁྱད་པར་ས་གནས་འཕགས་པའི་སེམས་ཅན་འགྱུར།
en: And be born as a noble being living in distinguished places.

source: །བཅོམ་ལྡན་འདས་ལ་དད་པའི་སེམས་བསྐྱེད་ནས།
en: Developing a faithful attitude toward the blessed ones,

source: །འདི་འདྲའི་དཔལ་འདི་ཕྱིར་ཞིང་མྱོང་བར་འགྱུར།
en: He will experience such excellent circumstances again and again.

source: །ང་ཡི་བྱ་བ་འདི་ནི་བརྗོད་པར་བྱ།
en: “I will now speak about my deeds;

source: །ངས་བརྗོད་འདི་ལ་ཐེ་ཙོམ་མ་སྐྱེད་ཅིག །སངས་རྒྱས་བཀའ་སྤངས་མནར་མེད་འགྲོར་འགྱུར་ཞིང་།
en: So do not doubt what I say! Rejecting the Buddha’s words, you will go to the Hell of Ceaseless Torment,

source: །ཕྱིན་ཆད་སྡུག་བསྔལ་ཉོན་མོངས་གྱུར་ཏ་རེ།
en: And experience suffering and affliction thenceforth. “Whoever removes cobwebs from the stūpas

source: །འཇིག་རྟེན་སྒྲོན་མ་མཚུངས་མེད་བསོད་ནམས་ཞིང་། །དེ་ཡི་མཆོད་རྟེན་བ་རྒྱ་སུ་སེལ་བ།
en: Of those who light up the world—the peerless fields of merit—

source: །བག་ཡོད་གྱུར་ནས་དེ་ནི་བདུད་རྒྱ་འདྲལ།
en: Will become conscientious and rend Māra’s net.

source: །དུས་རྣམས་ཀུན་ཏུ་ངན་སོང་ས་ཡང་སྤོང་།
en: Such a person will forever abandon birth into the lower realms.

source: །རྟག་ཏུ་སངས་རྒྱས་རྡུལ་བྲལ་བསྟི་སྟང་བྱེད།
en: “He will always honor the stainless buddhas

source: །རྟག་ཏུ་སྟོབས་ལྡན་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: And become a powerful universal monarch.

source: །མི་ཡི་འཇིག་རྟེན་སྐྱེས་ནས་བསོད་ནམས་ལྡན།
en: Born in the human world, he will be meritorious,

source: །རྒྱལ་པོ་ཀུན་གྱིས་མཆོད་པའི་གནས་སུ་འགྱུར།
en: And will become an object of worship for all the kings.

source: །ལྷ་ནང་ལྷ་ཡི་དབང་པོ་མཆོད་གནས་འགྱུར།
en: “He will be an object of worship for the lord of the gods,

source: །དེར་ནི་མྱུར་དུ་ལྷ་ཡི་ཚེ་ཡང་འཐོབ།
en: And will swiftly attain the life of the gods.

source: །དཔལ་ལྡན་གསེར་གྱི་གཞལ་མེད་ཁང་པ་རྙེད།
en: He will obtain splendid celestial palaces made of gold,

source: །ལྷ་ཡི་བདེ་བ་མཚུངས་མེད་དབང་ཕྱུག་ཉིད།
en: And become a lord of incomparable divine pleasures. “He will reach the divine worlds that are endowed

source: །གཟུགས་དང་སྒྲ་དང་དྲི་རབ་རོ་མཆོག་དང་། །རེག་བྱ་དཔལ་ལྡན་ལྷ་ཡི་འཇིག་རྟེན་འཐོབ།
en: With the most excellent sights, sounds, smells, tastes, and textures.

source: །མཐུ་ཆེན་ལྡན་ཞིང་བལྟ་བའི་འོས་སུ་འགྱུར།
en: He will be powerful and highly regarded,

source: །ལྷ་མོ་རྣམས་ལ་འདོད་པའི་སྲེད་མི་སྐྱེད།
en: But will never give rise to lust toward the goddesses.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་བ་རྒྱ་བསལ་བྱས་ན།
en: “Whoever removes cobwebs from the stūpa of a blessed one

source: །འདི་ནས་ཤི་འཕོས་མི་ཡི་འཇིག་རྟེན་འགྲོ།
en: Will, after he dies and transfers, proceed to the human world,

source: །ཡན་ལག་ལེགས་གནས་ཁྱད་པར་འགྲོ་བར་འགྱུར།
en: Where he will be reborn in distinguished places with firm limbs.

source: །ནམ་ཡང་བསྟན་བཅོས་མི་ཉུང་མང་པོ་འཐོབ།
en: He will always study numerous treatises.

source: །དེ་ནི་མི་ཁོམ་བརྒྱད་པོ་ཀུན་སྤོང་ཞིང་།
en: Will abandon all eight of the unfree states.

source: །དེ་ནི་དལ་འགྱུར་དེ་བཞིན་ཁྱད་པར་འཕགས།
en: Free from them, he will then enjoy preeminence,

source: །དེ་ནི་སངས་རྒྱས་མཚུངས་མེད་མཆོད་པ་བྱེད།
en: And worship the peerless buddhas.

source: །བག་ཡོད་བློ་གྲོས་བརྟན་ལ་དཔའ་བོར་འགྱུར།
en: Will become a hero—conscientious and intelligent.

source: །འདོད་པའི་ཡོན་ཏན་དག་ལ་དགའ་མི་སྐྱེད།
en: He will not enjoy sense pleasures,

source: །མི་དམན་སེམས་ཀྱིས་མངོན་པར་འབྱུང་བར་འགྱུར།
en: And, with a superior intention, he will leave home.

source: །དེ་ནི་ནམས་ཀྱང་བྱང་ཆུབ་སེམས་མི་འདོར།
en: Will never give up the mind set on awakening.

source: །ཚུལ་ཁྲིམས་སྐྱོན་མེད་ཤིན་ཏུ་བསྡམས་པར་འགྱུར།
en: Firmly restrained by flawless discipline,

source: །རྣམ་དག་འདོད་ཆགས་བྲལ་བའི་ཆོས་ཀྱང་འཐོབ།
en: He will receive the pure Dharma, which is free from desire.

source: །དེ་ཡི་མདོག་ངན་ལུས་རྣམས་ཀུན་ཏུ་སྤོང་།
en: Will abandon births with ugly bodies,

source: །འཆལ་པའི་ཤེས་རབ་མ་ལུས་རྣམ་པར་སྤོང་།
en: Or with any type of distorted insight.

source: །ཤེས་རབ་རྒྱ་ཆེན་གྱུར་ནས་སྤྱོད་ལ་གནས།
en: Instead, his insight will be vast, and he will observe proper conduct.

source: །ཁ་ཟས་གཙང་མ་དག་ཀྱང་རྙེད་འགྱུར་ལ།
en: Will receive clean and pure food,

source: །ཁྱད་འཕགས་ཁ་དོག་ལྡན་ཞིང་བལྟ་སྡུག་ལ།
en: As well as the most splendid, extraordinarily colorful fabrics,

source: །རེག་དང་ལྡན་ཞིང་རབ་མཛེས་གོས་རྣམས་འཐོབ། །དད་པའི་ཤུགས་བསྐྱེད་བཅོམ་ལྡན་མཆོད་རྟེན་ལ།
en: Beautiful to behold and pleasant to touch.

source: །མེ་ཏོག་སྐམ་པོ་ཉལ་ཉིལ་ཕྱགས་བྱས་ན།
en: “Whoever, out of faith, sweeps the withered flowers That sully the stūpa of a blessed one

source: །འདོད་པ་སྨད་པ་སྡུག་བསྔལ་བྱེད་པ་སྤོང་།
en: Will abandon all wicked desires that cause suffering,

source: །སྟོབས་བཅུ་མངའ་བའི་དེད་དཔོན་མཉེས་པར་བྱེད།
en: And thus please the captains endowed with the ten powers.

source: །མཆོད་རྟེན་མེ་ཏོག་རྙིས་པ་སུ་འཕྱག་པ།
en: “Whoever sweeps the old flowers from a stūpa

source: །དེ་ནི་མཛེས་ཤིང་རྣམ་དག་ལུས་སུ་འགྱུར།
en: Will be born with a beautiful and perfect body.

source: །སྐྱེ་བོ་མང་པོས་མཆོད་འོས་བལྟ་འོས་འགྱུར།
en: He will be worthy of the worship and regard of many beings,

source: །དེ་ལ་རྒྱལ་པོ་གནོད་པར་སེམས་མི་འགྱུར།
en: And kings will not give rise to malice toward him.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་དག་ལ་སྔ་རབས་མིས།
en: “Whoever sweeps from the stūpa of a blessed one

source: །མེ་ཏོག་ཕུལ་བ་སྐམ་པོ་ཕྱགས་བྱས་ན།
en: The withered flowers that people have previously offered

source: །ངན་སོང་ས་ཡི་ལམ་ངན་ཐམས་ཅད་གཅོད།
en: Will cut off all the paths to the lower realms,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཕུང་པོར་གནས།
en: And become a bodhisattva who observes discipline.

source: །བག་ཡོད་མྱ་ངན་རྣམས་དང་སྐྱོན་རྣམས་སྤོང་།
en: Will become conscientious and leave behind all misery and faults,

source: །ནད་རྣམས་དུ་མ་མ་ལུས་རྣམ་པར་སྤོང་།
en: And all the many forms of sickness.

source: །བསྐལ་པ་མཐའ་ཡས་རྣམས་སུ་དབུགས་ཕྱིན་ཐོབ།
en: He will find relief for countless eons.
